JSCBackend/app/controllers/companies_controller.rb

    def index
        companies = Company.all
---
SELECT "companies".* FROM "companies"