JSCBackend/app/controllers/follow_ups_controller.rb

SELECT "follow_ups".* FROM "follow_ups"
---
    def index
        follow_ups = FollowUp.all