JSCBackend/app/controllers/interviews_controller.rb

    def index
        interviews = Interview.all
---
SELECT "interviews".* FROM "interviews"