JSCBackend/app/controllers/job_applications_controller.rb

SELECT "job_applications".* FROM "job_applications"
---
    def index
        job_applications = JobApplication.all

SELECT "companies".* FROM "companies"
INSERT INTO "companies" ("name", "street_address", "city", "state", "zipcode", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "Appian"], ["street_address", " "], ["city", " "], ["state", " "], ["zipcode", 0], ["created_at", "2020-11-27 05:52:59.688676"], ["updated_at", "2020-11-27 05:52:59.688676"]]
INSERT INTO "job_applications" ("communication_type", "resume", "cover_letter", "status", "notes", "applied_location", "application_name", "user_id", "company_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
        def find_company
            id = Company.find do |n|
                n.name == params[:company_id]
                    n.id
                end
            return id
        end

        job_application = JobApplication.create(
            :communication_type,
            :resume_sent,
            :status,
            :resume,
            :cover_letter,
            :notes,
            :applied_location,
            :application_name,
            :interest_level,
            user_id: 8,
            company_id: find_company,
        )

SELECT "job_applications".* FROM "job_applications"
DELETE FROM "job_applications" WHERE "job_applications"."id" = $1  [["id", 13]]
---
    def destroy
        job_applications = JobApplication.all
        if @job_application.destroy

SELECT "job_applications".* FROM "job_applications" WHERE "job_applications"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
---
    def find_job_application
        @job_application = JobApplication.find(params[:id])