JSCBackend/app/controllers/job_applications_controller.rb

    def create
        company = Company.find_or_create_by(
            name: params[:name],
            street_address: params[:street_address],
            city: params[:city],
            state: params[:state],
            zipcode: params[:zipcode],
        )
        # byebug
        job_application = JobApplication.create(
            communication_type: params[:communication_type],
            resume_sent: Date.parse(params[:resume_sent]), # params: "2020-12-10T14:00:00.000Z"
            status: params[:status],
            resume: "",
            cover_letter: "",
            # resume: params[:resume],
            # cover_letter: params[:cover_letter],
            notes: params[:notes],
            applied_location: params[:applied_location],
            application_name: params[:application_name],
            interest_level: params[:interest_level],
            user_id: params[:user_id],
            company_id: company.id,
        )
---
INSERT INTO "job_applications" ("communication_type", "resume", "cover_letter", "status", "notes", "applied_location", "application_name", "user_id", "company_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
INSERT INTO "companies" ("name", "street_address", "city", "state", "zipcode", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "Appian"], ["street_address", " "], ["city", " "], ["state", " "], ["zipcode", 0], ["created_at", "2020-11-27 05:52:59.688676"], ["updated_at", "2020-11-27 05:52:59.688676"]]